Autodesk.Revit.DB.WorksharingTooltipInfo.GetRequesters
The ordered list of unique user names of users who have outstanding editing requests for
the specified element.
Remarks:
The list is ordered by who placed the earliest request.
If the list is empty it means that nobody is currently requesting the specified element.
Returns:
The ordered list of unique user names.
Since:
2012

Autodesk.Revit.DB.WorksharingTooltipInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksharingTooltipInfo.LastChangedBy
The user name of the most recent user who saved a user change of this element
to the central model.
Since:
2012

Autodesk.Revit.DB.WorksharingTooltipInfo.Creator
The user name of the user who created the element.
Since:
2012

Autodesk.Revit.DB.WorksharingTooltipInfo.Owner
The current owner of the element or empty string if no one owns the element.
Since:
2012

Autodesk.Revit.DB.WorksharingTooltipInfo
Worksharing information about a single element suitable for display in an in-canvas tooltip.
Remarks:
Some or all of the strings may be empty.
Since:
2012